[M_Sage_OldPukey MissionDefinition]
MissionDescription="Claptrap takes the ECHO unit from what he thinks is an old CL4P-TP unit to save the robot factory. You must follow the instructions and help CL4P-TP.."
TurnInDescription="Great hope that again collided with the rocks of despair!"
MissionSummary="Find the missing CL4P-TP."
TeaserText="I hope your stomach is empty.."

[M_Sage_OldPukey:FindPukey MissionObjectiveDefinition]
ProgressMessage="Check CL4P-TP Function"

[M_Sage_OldPukey:GetClaptrap MissionObjectiveDefinition]
ProgressMessage="Remove the CL4P-TP device"

[M_Sage_OldPukey:ProtectPukeySet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Claptrap discovers the ECHO, CL4P-TP's ancient weapon. I love Robot Co. and I hope you find this sign and give me a shout..<br><br>It turns out that this symptom is caused by a root problem. Claptrap is asked to guard the CL4P-TP barrel. to break."
